Revit 2024 API
ConnectionInputPointInfo.InputMemberIndex Property
 A index of the input member to which the restriction applies.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public int InputMemberIndex { get; set; }
Visual Basic
Public Property InputMemberIndex As Integer
	Get
	Set
Visual C++
public:
property int InputMemberIndex {
	int get ();
	void set (int value);
}
See Also
ConnectionInputPointInfo Class
Autodesk.Revit.DB.Structure Namespace